app/Controllers/Register.php

INSERT INTO `jadwal` (`id_user`, `no_ruang`, `tanggal`, `waktu_mulai`, `waktu_selesai`) VALUES ('11111', '1', '2025-12-08', '12:00', '15:00')
---
            return redirect()->back()->withInput();
        }

        $this->jadwalmodel->save([
            'id_user' => session()->get('id_user'),
            'no_ruang' => $this->request->getVar('no_ruang'),
            'tanggal' => $this->request->getVar('tanggal'),
            'waktu_mulai' => $this->request->getVar('waktu_mulai'),
            'waktu_selesai' => $this->request->getVar('waktu_selesai')
        ]);