app/Models/JadwalModel.php

SELECT *
FROM `jadwal`
---
  public function getJadwal($id_jadwal = false)
  {
    if ($id_jadwal == false) {
      return $this->findAll();