app/Models/UserModel.php

SELECT *
FROM `user`
WHERE `id_user` = '12345'
 LIMIT 1
---
    public function getUser($id_user) {
        return $this->where(['id_user' => $id_user])->first();